app/controllers/artists_controller.rb

  def index
    if params[:]
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"